---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FabricFailures.WrongFabricSheetOverallLength
source: html/30ce25df-7a22-d0c5-daab-15e70e5b06ac.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FabricFailures.WrongFabricSheetOverallLength Property

Wrong Overall Length/Width of the Fabric Sheet Type.

## Syntax (C#)
```csharp
public static FailureDefinitionId WrongFabricSheetOverallLength { get; }
```